index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-28 三 19:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DesZou.github.io</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dez" />
<link rel="stylesheet" type="text/css" href="readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">DesZou.github.io</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org135ac67">1. 关于</a></li>
<li><a href="#orgdd78944">2. 2018年</a>
<ul>
<li><a href="#org292cd8d">2.1. 2月</a>
<ul>
<li><a href="#org01ed12c">2.1.1. 7日</a></li>
<li><a href="#org6c65415">2.1.2. 9日</a></li>
<li><a href="#orgd82bf62">2.1.3. 20日</a></li>
<li><a href="#org162ce41">2.1.4. 21日</a></li>
<li><a href="#org572ac7d">2.1.5. 22日</a></li>
<li><a href="#orgf8b59a8">2.1.6. 23日</a></li>
<li><a href="#orga2d763a">2.1.7. 24日</a></li>
<li><a href="#org7c426a8">2.1.8. 25日</a></li>
<li><a href="#org8639e0d">2.1.9. 26日</a></li>
<li><a href="#org18b9a2e">2.1.10. 27日</a></li>
<li><a href="#orgf211775">2.1.11. 28日</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org135ac67" class="outline-2">
<h2 id="org135ac67"><span class="section-number-2">1</span> 关于</h2>
<div class="outline-text-2" id="text-1">
<p>
这是用来记录所有以后可能会用到的东西的地方，
也是拿来好玩的。这里的 css 样式来自 <a href="http://book.emacs-china.org/">http://book.emacs-china.org/</a>。
</p>

<div class="org-src-container">
<pre class="src src-cpp">
<span style="color: #6c3163;">#include</span> <span style="color: #3a81c3;">&lt;</span><span style="color: #2d9574;">iostream</span><span style="color: #3a81c3;">&gt;</span>

<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #6c3163; font-weight: bold;">main</span><span style="color: #3a81c3;">()</span> -&gt; <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #3a81c3;">{</span>
    <span style="color: #4e3163;">std</span>::cout &lt;&lt; <span style="color: #2d9574;">"Hello, world!"</span> &lt;&lt; <span style="color: #4e3163;">std</span>::endl;

    <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #4e3163;">0</span>;
<span style="color: #3a81c3;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd78944" class="outline-2">
<h2 id="orgdd78944"><span class="section-number-2">2</span> 2018年</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org292cd8d" class="outline-3">
<h3 id="org292cd8d"><span class="section-number-3">2.1</span> 2月</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org01ed12c" class="outline-4">
<h4 id="org01ed12c"><span class="section-number-4">2.1.1</span> 7日</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
今天看到一个比较有意思的 c++ 库 <a href="http://cgi.di.uoa.gr/~smaragd/fc++/">fc++</a> ，用 c++ 来实现函数式编程。
毫无疑问是用到了 <code>template</code> ，这点是跑不了的，多态什么的都得靠它。
但是让我吃惊的是它不需要用到任何新的 c++ 特性，
官网上的测试编译器只用到了 g++3 ！
（也说明了这个东西已经不新了）
不过有点坑的是它没有 <b>任何</b> 标准文档，就算是英文的也比没有要强得多啊。
但是它除了库文件之外还有一个文件夹的例子，里面有很多特性的示例，
也许读代码比文档会更好吧。
</p>
</div>
</div>
<div id="outline-container-org6c65415" class="outline-4">
<h4 id="org6c65415"><span class="section-number-4">2.1.2</span> 9日</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
<a href="https://deszou.github.io/plan0209.html">寒假计划</a>
</p>
</div>
</div>
<div id="outline-container-orgd82bf62" class="outline-4">
<h4 id="orgd82bf62"><span class="section-number-4">2.1.3</span> 20日</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
寒假过了，要干的事基本上就那样了。
今天晚上还好按时到了学校（寝室没有热水），想着总得做点事，
就抄了几道题目，好歹也是组了一套题（就是放在一起）。
又想起我哥说的：“不用想得太多，该做的时候做就好了。”
现在想来真是再符合我现在的困境不过了。不管怎样，
放假就到此为止了，总得找回一点努力学习的感觉了。
<del>其实这是我二十一号才写的</del>
</p>
</div>
</div>
<div id="outline-container-org162ce41" class="outline-4">
<h4 id="org162ce41"><span class="section-number-4">2.1.4</span> 21日</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
今天考了彭贻豪的题，三道题都是不可做的。
第一题是一个数学题，各种奇奇怪怪的递推加上一堆定理。
第二题是杜教筛，属于我永远想学但永远学不会的算法。
第三题是个网络流题，二元关系模型，看上去是最好做的一道题，
但是读题时出了点错误，搞得最后还是爆零了。 <del>hopeless</del>
</p>
</div>
</div>
<div id="outline-container-org572ac7d" class="outline-4">
<h4 id="org572ac7d"><span class="section-number-4">2.1.5</span> 22日</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
今天考的谢超才的题目，画风和昨天的有很大区别。
各种图论，数据结构之类的，唯一的共同点就是也全不会做。
第一题是 lct 动态维护最小生成树加上线段树分治。
第二题是图论题，关于找割点的。正解还要用到圆方树。
第三题是概率状压 DP ，我连看都没看出来，就像自动放弃了一样。
下午和晚上有一直在看一道 lct 的题目，终于慢慢地懂了一点。
</p>
</div>
</div>
<div id="outline-container-orgf8b59a8" class="outline-4">
<h4 id="orgf8b59a8"><span class="section-number-4">2.1.6</span> 23日</h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
今天没有考试，好像是因为学校里回来人 <b>视察</b> 。结果什么都没看到。
中午没有休息好，结果下午就开始头痛。又好死不死地挑了一个超级难的题，
浪费了一个下午。晚上头痛依旧，用 Haskell 打发了时间，实在是没有什么动力。
What a bad day~
</p>
</div>
</div>
<div id="outline-container-orga2d763a" class="outline-4">
<h4 id="orga2d763a"><span class="section-number-4">2.1.7</span> 24日</h4>
<div class="outline-text-4" id="text-2-1-7">
<p>
现在每天都有点拖拉，每次的内容都要丢到第二天写。
这样下去，记这个就又没有什么用处了。晚上回家看 HP 竟然看到 1 点钟，
我肯定是疯了，都没有什么感觉了。
</p>
</div>
</div>
<div id="outline-container-org7c426a8" class="outline-4">
<h4 id="org7c426a8"><span class="section-number-4">2.1.8</span> 25日</h4>
<div class="outline-text-4" id="text-2-1-8">
<p>
哇，真的不该玩到 4 点再睡的，中午竟然睡过头了！
要不是 B 哥给老师打了电话，我恐怕得睡到 5 点去了。
今天考的题有一道比较简单的也没做出来，不过也没什么好说的，
人都困成这样了，还能怎么样。现在身体是真的不太好，
没有什么精神，也涨不了肉，就是几根杆子。
</p>

<p>
发现把这东西写作一个文件有一点不好：如果我要到别的电脑上加一点东西，
就得先把原来的文件下载下来，虽然只有一个文件，
可我不用 hexo 之类的原因就是不想配置，在哪想到就在哪可以写。
（其实首先得有个 Emacs ）得想个像样的办法把它解决了。
</p>
</div>
</div>
<div id="outline-container-org8639e0d" class="outline-4">
<h4 id="org8639e0d"><span class="section-number-4">2.1.9</span> 26日</h4>
<div class="outline-text-4" id="text-2-1-9">
<p>
人生污点的考试。。。这样的弱智题竟然没做出来，脑子已经不存在了。
现在再看 FC++ 感觉看到了屎，实现跟优雅扯不上边。
学习了 <code>std::transform</code> 和 <code>std::for_each</code> ，希望能让代码好看点，
毕竟我也只有这么点追求了。下午好歹吧两个弱智题改了，学习了快速幂的新姿势。
晚上把 io 给写了，一个星期来的第一次啊，要保持下去。
</p>
</div>
</div>
<div id="outline-container-org18b9a2e" class="outline-4">
<h4 id="org18b9a2e"><span class="section-number-4">2.1.10</span> 27日</h4>
<div class="outline-text-4" id="text-2-1-10">
<p>
28 日补写。为了一个只有区间翻转的 splay tree ，花了我大半个下午加晚上，
整个人都不好了。先是去网上搜了一波维护区间的正确姿势，然后码。。。
结果脑子进了水，明知道要区间翻转，还去用数组随机访问节点，能对就出了鬼了。
好吧，那就用 rank 查找吧，写起来一个函数的事。结果依旧段错误。
结果晚上到处 debug ，左也一个错误，右也一个错误。真正的原因又出在新写的查找上，
我忘记下传标记了。结果等题做出来了，一个晚上也结结实实花完了。
并且最后的最后，还有一个错误：特判单点之后没有 <code>splay</code> ，
导致一个全是单点查询的点 TLE 了。
</p>
</div>
</div>
<div id="outline-container-orgf211775" class="outline-4">
<h4 id="orgf211775"><span class="section-number-4">2.1.11</span> 28日</h4>
<div class="outline-text-4" id="text-2-1-11">
<p>
连写两天 io 。今天竟然考了我的题目，真是“受宠若惊”了，呵呵。
托考试的福，今天上午总算撸了点正经玩意：可持久化 Treap 。
虽然很水（那又怎么样呢），实现的还比较满意。缺点就是没有用指针，
但是我好不容易有一个这么好写的数据结构，实在不忍心让它变复杂。
可持久化的部分很好加入，只要把 <code>split</code> 里面的返回值变成原节点的 copy 就行了。
</p>

<p>
今天还在 <a href="https://zh.cppreference.com">cppreference</a> 里淘了会儿宝，发现了两个好东西：第一个是 <code>std::make_heap</code> ，
<code>std::push_heap</code> ， <code>std::pop_heap</code> 这一组函数，可以用自己定义的空间维护一个堆。
速度非常不错（至少和 <code>std::priority_queue</code> 比起来），以后再也不用手写堆了。
PS ：好像 <code>std::priority_queue</code> 存在的原因是因为上面那组函数可能会被强制破坏堆的性质。
可是它用了 <code>std::vector</code> 管理内存，这就让它有点鸡肋了（慢是原罪）。
第二个是 <code>std::valarray</code> ，其实用处不会很大。但是让我知道 c++ 有这个东西心里会舒服一点。
它本来是设计来进行数学运算的，定义了各种运算符号。让我觉得舒服的是 <code>std::slice</code> ！
切片！ python 有的 c++ 也有！（让我有种扬眉吐气的感觉）并且在 c++98 就支持了。
奇怪的是他没有迭代器，这让我百思不得其解，既然他也是从 <code>std::vector</code> 继承来的，
为什么不定义一个迭代器呢？只能通过下标访问，唯一的解释就是它要和数学运算挂钩。
（但这也不影响它加一个迭代器啊？）
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dez</p>
<p class="date">Created: 2018-02-28 三 19:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
